<?php
require "inc/lib.inc.php";
?>
<!DOCTYPE html>
<html lang="en">
<head>
    <title>О сайте</title>
    <meta charset="UTF-8">
    <link rel="stylesheet" href="bootstrap.min.css">
    <link rel="stylesheet" href="style.css">
</head>
<body>
<div id="header">
    <!-- Верхняя часть страницы -->
    <!-- <img src="img/specialist.jpg" width="187" height="29" alt="Наш логотип" class="logo" /> -->
    <img src="img/specialist.jpg" width="150" alt="Наш логотип" class="logo" />
    <span class="slogan">приходите к нам учиться</span>
    <!-- Верхняя часть страницы -->
</div>

<div id="content">
    <!-- Заголовок -->
    <!-- Область основного контента -->
    <h3>О нашем сайте</h3>
    <p>
        Сайт создан на общественных началах и управляется на некоммерческой основе.
        Все фотографии и материалы предоставлены и используются с ведома и при участии
        администрации школы.
    </p>

    <h3>Цель создания проекта</h3>
    <ol>
        <li>поднятие престижа нашей школы</li>
        <li>для информирования родителей будущих учеников нашей школы</li>
        <li>
            для возобновления утраченных связей между выпускниками и учителями,
            с предоставлением им информационного пространства для общения
        </li>
        <li>для общения учеников во внеурочное время.</li>
    </ol>

    <h3>Советы и предупреждения</h3>
    <p>
        Сайт оптимизирован под все браузеры.
        Наилучшее качество просмотра достигается при разрешении экрана монитора - 1280 на 1024 точек.
    </p>

    <!-- Область основного контента -->
    <!-- Заголовок -->
</div>
<div id="nav">
    <!-- Меню -->
    <!-- Навигация -->
    <h2>Навигация по сайту</h2>
    <ul>
        <li><a href="index.php">Домой</a></li>
        <li><a href="about.php">О нас</a></li>
        <li><a href="contact.php">Контакты</a></li>
        <li><a href="table.php">Таблица умножения</a></li>
        <li><a href="calc.php">Калькулятор</a></li>
    </ul>
    <!-- Меню -->
    <!-- Навигация -->
</div>
<div id="footer">
    <!-- Нижняя часть страницы -->
    &copy; Супер Мега Веб-мастер, 2000 &ndash; 2023
    <!-- Нижняя часть страницы -->
</div>
</body>

</html>